{"config": [{"config": {"activation": "relu", "activity_regularizer": null, "name": "dense_1", "use_bias": true, "units": 12, "kernel_constraint": null, "batch_input_shape": [null, 8], "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "activity_regularizer": null, "name": "dense_2", "use_bias": true, "units": 8, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "activity_regularizer": null, "name": "dense_3", "use_bias": true, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.5", "class_name": "Sequential"}